hpmicro/zephyr_sdk_glue/include/dt-bindings/clock/hpm6750-clocks.h
/*
 * Copyright (c) 2024 HPMicro
 *SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HPM6750_CLOCKS_H
#define ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HPM6750_CLOCKS_H

/*
 *
 *<---------------------- AUTO_GENERATE ---------------------->
 *    This file was auto-generated, do not edit anything.
 *    generated on 2024-04-28 20:23:20 
 */

#define CLK_SRC_OSC24M  0
#define CLK_SRC_PLL0_CLK0  1
#define CLK_SRC_PLL1_CLK0  2
#define CLK_SRC_PLL1_CLK1  3
#define CLK_SRC_PLL2_CLK0  4
#define CLK_SRC_PLL2_CLK1  5
#define CLK_SRC_PLL3_CLK0  6
#define CLK_SRC_PLL4_CLK0  7
#define CLK_SRC_OSC32K  8
#define CLK_ADC_SRC_AHB0  16
#define CLK_ADC_SRC_ANA0  17
#define CLK_ADC_SRC_ANA1  18
#define CLK_ADC_SRC_ANA2  19
#define CLK_I2S_SRC_AHB0  32
#define CLK_I2S_SRC_AUD0  33
#define CLK_I2S_SRC_AUD1  34
#define CLK_I2S_SRC_AUD2  35
#define CLK_WDG_SRC_AHB0  48
#define CLK_WDG_SRC_OSC32K  49
#define CLK_PWDG_SRC_OSC24M  192
#define CLK_PWDG_SRC_OSC32K  193
#define CLK_SRC_INVALID  255

#define CLOCK_CPU0  0
#define CLOCK_CPU1  524290
#define CLOCK_MCHTMR0  17301505
#define CLOCK_MCHTMR1  17367043
#define CLOCK_AXI0  16842756
#define CLOCK_AXI1  16908293
#define CLOCK_AXI2  16973830
#define CLOCK_AHB  16777223
#define CLOCK_FEMC  17039368
#define CLOCK_XPI0  17563657
#define CLOCK_XPI1  17629194
#define CLOCK_GPTMR0  18481163
#define CLOCK_GPTMR1  18546700
#define CLOCK_GPTMR2  18612237
#define CLOCK_GPTMR3  18677774
#define CLOCK_GPTMR4  18743311
#define CLOCK_GPTMR5  18808848
#define CLOCK_GPTMR6  18874385
#define CLOCK_GPTMR7  18939922
#define CLOCK_UART0  19005459
#define CLOCK_UART1  19070996
#define CLOCK_UART2  19136533
#define CLOCK_UART3  19202070
#define CLOCK_UART4  19267607
#define CLOCK_UART5  19333144
#define CLOCK_UART6  19398681
#define CLOCK_UART7  19464218
#define CLOCK_UART8  19529755
#define CLOCK_UART9  19595292
#define CLOCK_UART10  19660829
#define CLOCK_UART11  19726366
#define CLOCK_UART12  19791903
#define CLOCK_UART13  19857440
#define CLOCK_UART14  19922977
#define CLOCK_UART15  19988514
#define CLOCK_I2C0  20054051
#define CLOCK_I2C1  20119588
#define CLOCK_I2C2  20185125
#define CLOCK_I2C3  20250662
#define CLOCK_SPI0  20316199
#define CLOCK_SPI1  20381736
#define CLOCK_SPI2  20447273
#define CLOCK_SPI3  20512810
#define CLOCK_CAN0  20578347
#define CLOCK_CAN1  20643884
#define CLOCK_CAN2  20709421
#define CLOCK_CAN3  20774958
#define CLOCK_DISPLAY  21954614
#define CLOCK_SDXC0  22544449
#define CLOCK_SDXC1  22609986
#define CLOCK_CAMERA0  22020151
#define CLOCK_CAMERA1  22085688
#define CLOCK_NTMR0  22413375
#define CLOCK_NTMR1  22478912
#define CLOCK_PTPC  20840495
#define CLOCK_REF0  22806589
#define CLOCK_REF1  22872126
#define CLOCK_WATCHDOG0  18219776
#define CLOCK_WATCHDOG1  18285313
#define CLOCK_WATCHDOG2  18350850
#define CLOCK_WATCHDOG3  18416387
#define CLOCK_PUART  4294902784
#define CLOCK_PWDG  4294904832
#define CLOCK_ETH0  22282297
#define CLOCK_ETH1  22347834
#define CLOCK_PTP0  4294901819
#define CLOCK_PTP1  4294901820
#define CLOCK_SDP  17696256
#define CLOCK_XDMA  17958401
#define CLOCK_ROM  17106434
#define CLOCK_RAM0  17434115
#define CLOCK_RAM1  17499652
#define CLOCK_USB0  22677248
#define CLOCK_USB1  22742785
#define CLOCK_JPEG  22153216
#define CLOCK_PDMA  22218753
#define CLOCK_KMAN  17827072
#define CLOCK_GPIO  18023681
#define CLOCK_MBX0  18089218
#define CLOCK_MBX1  18154755
#define CLOCK_HDMA  17892612
#define CLOCK_RNG  17761541
#define CLOCK_MOT0  21693702
#define CLOCK_MOT1  21759239
#define CLOCK_MOT2  21824776
#define CLOCK_MOT3  21890313
#define CLOCK_ACMP  21169418
#define CLOCK_PDM  21496320
#define CLOCK_DAO  21561857
#define CLOCK_MSYN  21628172
#define CLOCK_LMM0  17172736
#define CLOCK_LMM1  17238528
#define CLOCK_ANA0  4294901808
#define CLOCK_ANA1  4294901809
#define CLOCK_ANA2  4294901810
#define CLOCK_ADC0  20906240
#define CLOCK_ADC1  20971777
#define CLOCK_ADC2  21037314
#define CLOCK_ADC3  21102851
#define CLOCK_AUD0  4294901811
#define CLOCK_AUD1  4294901812
#define CLOCK_AUD2  4294901813
#define CLOCK_I2S0  21234176
#define CLOCK_I2S1  21299713
#define CLOCK_I2S2  21365250
#define CLOCK_I2S3  21430787
#define CLK_OSC0CLK0  2099968
#define CLK_PLL0CLK0  2231041
#define CLK_PLL1CLK0  2362114
#define CLK_PLL1CLK1  2427651
#define CLK_PLL2CLK0  2558724
#define CLK_PLL2CLK1  2624261
#define CLK_PLL3CLK0  2755334
#define CLK_PLL4CLK0  2886407


#endif  /* ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HPM6750_CLOCKS_H */
